---
kind: method
id: M:Autodesk.Revit.DB.PointCloudInstance.ContainsScan(System.String)
source: html/989fa5aa-6a04-2198-44e4-bde5d49fc2a9.htm
---
# Autodesk.Revit.DB.PointCloudInstance.ContainsScan Method

Identifies whether the instance contains a scan.

## Syntax (C#)
```csharp
public bool ContainsScan(
	string scanName
)
```

## Parameters
- **scanName** (`System.String`) - Name of the scan.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null